---
kind: type
id: T:Autodesk.Revit.DB.PlanTopology
source: html/32cd44a8-9c84-47c4-5c8e-853559f05d41.htm
---
# Autodesk.Revit.DB.PlanTopology

An object that represents a Plan Topology within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class PlanTopology : APIObject
```

## Remarks
This object derived from the APIObject base object. It can be used access the properties
of a Plan Topology.